app/Filament/Resources/UserResource/Widgets/UserStatsOverview.php

    protected function getStats(): array
    {
        return [
            Stat::make('Number Of Users', User::count()),
            Stat::make('Number Of Admins', User::where('role', User::ADMIN_ROLE)->count()),
            Stat::make('Number Of Editors', User::where('role', operator: User::EDITOR_ROLE)->count()),
---
select count(*) as aggregate from `users` where `role` = 'ADMIN'
select count(*) as aggregate from `users` where `role` = 'EDITOR'