app/Filament/Resources/CategoryResource/Widgets/CategoryStatsOverview.php

    protected function getStats(): array
    {
        return [
            stat::make('Number Of Categories', Category::count()),
        ];
---
select count(*) as aggregate from `categories`