app/Filament/Resources/PostResource/Widgets/PostStatsOverview.php

select count(*) as aggregate from `posts` where `featured` = 1 and `posts`.`deleted_at` is null
---
    protected function getStats(): array
    {
        return [
            Stat::make('Number Of Post', Post::count()),
            Stat::make('Featured Of Post', Post::where('featured', 1)->count()),