<?php

return [
    'profile_info' => 'معلومات الملف الشخصي',
    'profile_update' => 'قم بتحديث معلومات حسابك والبريد الإلكتروني.',
    'photo' => 'الصورة',
    'select_photo' => 'اختر صورة جديدة',
    'remove_photo' => 'إزالة الصورة',
    'name' => 'الاسم',
    'email' => 'البريد الإلكتروني',
    'save' => 'حفظ',
    'saved' => 'تم الحفظ.',

    // password Update
    'update_pass' => 'تحديث كلمة المرور',
    'pass_desc' => 'تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية للبقاء آمنًا.',
    'current' => 'كلمة المرور الحالية',
    'new' => 'كلمة المرور الجديدة',
    'confirm' => 'تأكيد كلمة المرور',

];