app/Filament/Resources/CommentResource/Widgets/CommentStatsOverview.php

    protected function getStats(): array
    {
        return [
            stat::make('Number Of Comments', Comment::count())
        ];
---
select count(*) as aggregate from `comments`