app/Livewire/PostComments.php

insert into `comments` (`comment`, `user_id`, `post_id`, `updated_at`, `created_at`) values ('74MSkAZR7V8ze9Xz487j2RO7lL1bN6qbFz\'', 101, 64, '2024-12-12 19:47:59', '2024-12-12 19:47:59')
---
    public function postComment(){
        if(Auth::guest()){
            return ;
        }
        $this->validateOnly('comment');
        $this->post->comments()->create([
            'comment' => $this->comment,
            'user_id' => Auth::id(),
        ]);

select * from `comments` where `comments`.`post_id` = 64 and `comments`.`post_id` is not null order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (101)
select count(*) as aggregate from `comments` where `comments`.`post_id` = 64 and `comments`.`post_id` is not null
---
    public function comments(){
        return $this->post->comments()->with('user')->latest()->paginate(5);