app/Livewire/PostList.php

select `categories`.*, `category_post`.`post_id` as `pivot_post_id`, `category_post`.`category_id` as `pivot_category_id` from `categories` inner join `category_post` on `categories`.`id` = `category_post`.`category_id` where `category_post`.`post_id` in (7, 17, 25, 47, 49)
select * from `posts` where `published_at` <= '2024-12-12 19:31:02' and `title` like '%%' and `posts`.`deleted_at` is null order by `published_at` desc limit 5 offset 0
select count(*) as aggregate from `posts` where `published_at` <= '2024-12-12 19:31:02' and `title` like '%%' and `posts`.`deleted_at` is null
---
    public function posts(){
        return Post::published()
        ->orderBy('published_at', $this->sort)
        ->when($this->activeCategory, function($query){
            $query->withCategory($this->category);
        })
        ->where('title','like', "%{$this->search}%" )
        ->paginate(5);

select * from `categories` where `slug` = '' limit 1
---
    public function activeCategory(){
        return Category::where('slug', $this->category)->first();