app/Http/Controllers/HomeController.php

select `categories`.*, `category_post`.`post_id` as `pivot_post_id`, `category_post`.`category_id` as `pivot_category_id` from `categories` inner join `category_post` on `categories`.`id` = `category_post`.`category_id` where `category_post`.`post_id` in (7, 17, 25, 32, 43, 47, 49, 63, 81)
select * from `posts` where `published_at` <= '2024-12-12 23:29:01' and `featured` = 1 and `posts`.`deleted_at` is null order by `published_at` desc limit 3
select * from `posts` where `published_at` <= '2024-12-12 19:40:05' and `featured` = 1 and `posts`.`deleted_at` is null order by `published_at` desc limit 3
select `categories`.*, `category_post`.`post_id` as `pivot_post_id`, `category_post`.`category_id` as `pivot_category_id` from `categories` inner join `category_post` on `categories`.`id` = `category_post`.`category_id` where `category_post`.`post_id` in (19, 43, 64)
select * from `posts` where `published_at` <= '2024-12-12 19:40:05' and `posts`.`deleted_at` is null order by `published_at` desc limit 9
---
    public function __invoke(Request $request)
    {
        return view('home',
    [
        'featuredPost' => Post::published()->with('categories')->featured()->latest('published_at')->take(3)->get(),
        'latestPost' => Post::published()->with('categories')->latest('published_at')->take(9)->get(),
    ]);